# Sets up OMZ env ($ZSH, $ZSH_CACHE_DIR, etc.) so OMZ plugins work via antidote.
# MUST be before any ohmyzsh/ohmyzsh entries.
getantidote/use-omz

# OMZ library (compinit, themes infra)
ohmyzsh/ohmyzsh path:lib

# OMZ plugins
ohmyzsh/ohmyzsh path:plugins/git
ohmyzsh/ohmyzsh path:plugins/extract
ohmyzsh/ohmyzsh path:plugins/copypath
ohmyzsh/ohmyzsh path:plugins/copyfile
ohmyzsh/ohmyzsh path:plugins/copybuffer
ohmyzsh/ohmyzsh path:plugins/uv
ohmyzsh/ohmyzsh path:plugins/tmux
ohmyzsh/ohmyzsh path:plugins/sublime
ohmyzsh/ohmyzsh path:plugins/python
ohmyzsh/ohmyzsh path:plugins/pip
ohmyzsh/ohmyzsh path:plugins/history
ohmyzsh/ohmyzsh path:plugins/cp
# macos plugin self-guards on $OSTYPE so it's a no-op on Linux
ohmyzsh/ohmyzsh path:plugins/macos

# third-party (after OMZ lib so compinit is available)
zsh-users/zsh-autosuggestions
Aloxaf/fzf-tab
zdharma-continuum/fast-syntax-highlighting kind:defer